<!DOCTYPE>
<html>
	<head>
		<meta http-equiv="Content-Type" content="text/html; charset=utf-8">
		<link rel='stylesheet' href='style.css' type='text/css' />
		<title>Test</title>
	</head>
	<body>
		<div id="wrapper">
			<img src="img/logo_softgroup.png">
			<div>
				<nav id="top_menu">
					<ul>
						<li><a href="index.php">Головна</a></li>
						<li><a href="author.php">Автор</a></li>
						<li><a href="http://softgroup.ua/">Softgroup</a></li>
					</ul>
				</nav>
			</div>
			<div id="sidebar">
				<nav>
					<ul id="left_menu">
						<li><a href="1.php">Завдання 1</a></li>
						<li><a href="2.php">Завдання 2</a></li>
						<li><a href="3.php">Завдання 3</a></li>
						<li><a href="4.php">Завдання 4</a></li>
						<li><a href="5.php">Завдання 5</a></li>
						<li><a href="6.php">Завдання 6</a></li>
					</ul>
				</nav>
			</div>
			<div id="content">
				<div id="title">
					<h1>Softgroup</h1>
					<h2>Тестове завдання</h2>
				</div>
				<h3>Завдання 4 </h3>
				<p>	Політичне життя однієї країни дуже жваве. У країні діє K політичних 
					партій, кожна з яких регулярно оголошує національний страйк. Дні, коли 
					хоча б одна з партій оголошує страйк, за умови, що це не субота або неділя 
					(коли і так ніхто не працює), завдають великої шкоди економіці країни.</br>
					i-та партія оголошує страйки строго кожні bi днів, починаючи з дня з 
					номером ai. Тобто i-та партія оголошує страйки в дні ai, ai + bi, ai + 2bi і т.д. 
					Якщо в якийсь день кілька партій оголошує страйк, то це вважається 
					загальнонаціональним страйком.</br>
					У календарі країни N днів, пронумерованих від 1 до N. Перший день 
					року є понеділком, шостий і сьомий дні року - вихідні, тиждень складається 
					з семи днів.</br>
					<p>Вхідні дані</br>
					Програма отримує на вхід число днів в році N (1 < N < 1000000) і число
					політичних партій K (1 < K < 100). Далі йде K рядків, що описують графіки
					проведення страйків. i-й рядок містить числа ai і bi (1 < ai,bi < N).</br></p>
					<p>Вихідні дані</br>
					Виведіть єдине число: кількість страйків, що відбулися протягом року.</br></p>
					<p>Примітка</br>
					Перша партія оголошує страйки в дні 2, 5, 8, 11, 14, 17. Друга партія 
					оголошує страйки в дні 3, 8, 13, 18. Третя партія - в дні 9 і 17. Дні номер 6,
					7, 13, 14 є вихідними. Таким чином, загальнонаціональні страйки пройдуть в
					дні 2, 3, 5, 8, 9, 11, 17, 18.</p>
				</p>
				<div>
					<h3>Розв'язок</h3>
				</div>
			</div>
		</div>
	</body>
</html>