<!DOCTYPE>
<html>
	<head>
		<meta http-equiv="Content-Type" content="text/html; charset=utf-8">
		<link rel='stylesheet' href='style.css' type='text/css' />
		<title>Test</title>
	</head>
	<body>
		<div id="wrapper">
			<img src="img/logo_softgroup.png">
			<div>
				<nav id="top_menu">
					<ul>
						<li><a href="index.php">Головна</a></li>
						<li><a href="author.php">Автор</a></li>
						<li><a href="http://softgroup.ua/">Softgroup</a></li>
					</ul>
				</nav>
			</div>
			<div id="sidebar">
				<nav>
					<ul id="left_menu">
						<li><a href="1.php">Завдання 1</a></li>
						<li><a href="2.php">Завдання 2</a></li>
						<li><a href="3.php">Завдання 3</a></li>
						<li><a href="4.php">Завдання 4</a></li>
						<li><a href="5.php">Завдання 5</a></li>
						<li><a href="6.php">Завдання 6</a></li>
					</ul>
				</nav>
			</div>
			<div id="content">
				<img src="img/author.png">
				<p><h3>ПІБ:</h3> Шкавро Олексій Вікторович</p>
				<p><h3>Мета:</h3> здобуття посади програміста</p>
				<p><h3>Досвід роботи:</h3></p>
				<p>2011 - 2015 рр.			ЛКМ «Велес» -  інженер по обслуговуванню мережі інтернет.</p>
				<p>2015 - 2017 рр.			ЛКМ «Велес» -  додатково системний адміністратор медичних центрів МРТ в Івано-Франківську й Тернополі, а також КТ у Києві.</p>
				<p><h3>Освіта:</h3></p>
				<p>2013-2014 рр               Чернівецький національний університет ім. Ю. Федьковича (отримав диплом спеціаліста зі спеціальності «Програмне забезпечення систем» та здобув кваліфікацію інженера-програміста);</p>
				<p>2011-2013 рр               Чернівецький національний університет ім. Ю. Федьковича (отримав диплом бакалавра зі спеціальності «Програмна інженерія» та здобув кваліфікацію фахівця з розробки та тестування програмного забезпечення);</p>
				<p>2007-2011 рр               Чернівецький політехнічний коледж (отримав диплом молодшого спеціаліста за спеціальністю «Програмування для електронно-обчислювальної техніки і автоматизованих систем» і здобув кваліфікацію технік-програміст);</p>
				<p>1999-2007рр.               Чернівецька гімназія № 7 (з поглибленим вивченням іноземної мови)</p>
				<p><h3>Професійні знання та навички:</h3></p>
				<p>-	Знаю архітектуру ПК та володію досвідом збору, модернізації і його ремонту;</p>
				<p>-	Здійснював інсталяцію, налаштування та оптимізацію системного програмного забезпечення під ОС типу Linux й Windows для медичного обладнання;</p>
				<p>-	Володію знаннями в HTML, CSS, JavaScript, JQuery, PHP, Java, MySQL; CMS - WordPress, Drupal; Eclipse, Embarcadero Rad Studio, Android Studio, Adobe Muse, GitHub</p>
				<p>-	Маю досвід в побудові мереж Ethernet і систем відеонагляду, їх налаштуванні, моніторингу та обслуговуванню</p>
				<p><h3>Знання мов:</h3></p>
				<p>Вільно володію українською та російською мовами, задовільно – англійською;</p>
				<p><h3>Особисті якості:</h3></p>
				<p>Комунікабельність, цілеспрямованість, наполегливість, легко засвоюю нові знання.</p>
				<div id="date"><p>5 січня 2017 року</p></div>

			</div>
			<div id="footer">&copy; Шкавро Олексій - 2017.</div>
		</div>
	</body>
</html>